require 'json'

# ----------------------------------
# What's this
# ----------------------------------
# data_collector.rb及びrandom_clientで収集した棋譜の
# 整理を行う。
# - DATA_DIR配下のファイルを処理対象とする
# - 以下のルールで整理を行う
#   - ファイル名: 手数.json
#   - ファイル内容: 
#     {"records":[
#       {
#         result: true,                      # 最終的な勝敗
#         "board": [null, "w", "b", ..],     # 盤面=配列長64の１次元配列
#         "move": {"c": "w", "x": 4, "y": 3} # 指手=色, 座標
#       }
#     ]}
# - 以下に示す対称な盤面は同一盤面と見なす
#   - LineSymmetry
#   - RotateSymmetry
#   ↑これは計算しない方がいい? TensorFlowにData渡す&&演算する時どうなる?
#

# ----------------------------------
# conf
# ----------------------------------
DATA_DIR = "../raw_data"


# ----------------------------------
# methods
# ----------------------------------
#
#


# ----------------------------------
# main
# ----------------------------------
